// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
	// 1. перебрати його циклом while
	// 2. перебрати його циклом for
	// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
	// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
	// 5. перебрати циклом while та вивести  числа тільки парні  значення
	// 6. перебрати циклом for та вивести  числа тільки парні  значення
	// 7. замінити кожне число кратне 3 на слово "okten"
	// 8. вивести масив в зворотньому порядку.
	// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
	// 10
// створити пустий масив та :
	// - заповнити його 50 парними числами за допомоги циклу.
	// - заповнити його 50 непарними числами за допомоги циклу.

let arr = [2,17,13,6,22,31,45,66,100,-18];

// let i = 0;
// while (i < arr.length) {
	// console.log(arr[i]);
	// i++;
// };

// for (i of arr) {
	// console.log(i);
// };

// let i = 1;
// while (i < arr.length) {
	// console.log(`(${[i]}) ${arr[i]}`);
	// i += 2;
// };

// for (i = 1; i < arr.length; i += 2) {
	// console.log(`(${[i]}) ${arr[i]}`);
// };

// let i = 0;
// while (i < arr.length) {
	// if (arr[i] % 2 === 0) { 
		// console.log(arr[i]);
	// };
	// i ++;
// };

// for (i of arr){				
	// if (i % 2 === 0){
		// console.log(i);
	// };
// };

// for (i of arr) {
	// if (i % 3 === 0){
		// i = "octen";
	// };
	// console.log(i);
// };

for (i of arr){
	arr.reverse();
	console.log(arr[i]);
};
